[net]
batch_size=10
label_learning_epochs=10
epochs=20
learning_rate=0.1
learning_rate_decay=0.1
learning_rate_change_epochs=10
optimizer="SGD"
SGD_momentun=0.9
early_stop=0
channels=3

[convolutional]
batch_normalize=1
filters=6
size=5
stride=1
pad=0

[relu]

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=16
size=5
stride=1
pad=0

[relu]

[maxpool]
size=2
stride=2

[flatten]

[linear]
in=400
out=120

[relu]

[linear]
in=120
out=84

[relu]

[linear]
in=84
out=10

